# 1. В диапазоне натуральных чисел от 2 до 99 определить,
# сколько из них кратны каждому из чисел в диапазоне от 2 до 9.
# Примечание: 8 разных ответов.

dict = {'кратно 2':0, 'кратно 3':0, 'кратно 4':0,
        'кратно 5':0, 'кратно 6':0, 'кратно 7':0, 'кратно 8':0, 'кратно 9':0 }

for i in range(2 , 100):
    dict['кратно 2'] += (1 if i % 2 == 0 else 0)
    dict['кратно 3'] += (1 if i % 3 == 0 else 0)
    dict['кратно 4'] += (1 if i % 4 == 0 else 0)
    dict['кратно 5'] += (1 if i % 5 == 0 else 0)
    dict['кратно 6'] += (1 if i % 6 == 0 else 0)
    dict['кратно 7'] += (1 if i % 7 == 0 else 0)
    dict['кратно 8'] += (1 if i % 8 == 0 else 0)
    dict['кратно 9'] += (1 if i % 9 == 0 else 0)

for key, value in dict.items():
    print(f'{key}: {value} числа')